import React from "react";
import "../../css/Main.css"

function Info() {
    return (
        <>
            <a href="#" className="boardTitle">소개하는 글</a>
            <hr />
            <div className="boardContents">
                <div className="infoImg" />
                <div>
                    혼인과 가족생활은 개인의 존엄과 양성의 평등을 기초로 성립되고 유지되어야 하며, 국가는 이를 보장한다. 대통령은 국민의 보통·평등·직접·비밀선거에 의하여 선출한다.
                    연소자의 근로는 특별한 보호를 받는다. 각급 선거관리위원회의 조직·직무범위 기타 필요한 사항은 법률로 정한다. 국회에 제출된 법률안 기타의 의안은 회기중에 의결되지 못한 이유로 폐기되지 아니한다. 다만, 국회의원의 임기가 만료된 때에는 그러하지 아니하다.
                    제1항의 지시를 받은 당해 행정기관은 이에 응하여야 한다. 법관은 헌법과 법률에 의하여 그 양심에 따라 독립하여 심판한다. 신체장애자 및 질병·노령 기타의 사유로 생활능력이 없는 국민은 법률이 정하는 바에 의하여 국가의 보호를 받는다.
                    헌법개정은 국회재적의원 과반수 또는 대통령의 발의로 제안된다. 대한민국의 경제질서는 개인과 기업의 경제상의 자유와 창의를 존중함을 기본으로 한다.
                    제2항과 제3항의 처분에 대하여는 법원에 제소할 수 없다. 국가는 사회보장·사회복지의 증진에 노력할 의무를 진다. 모든 국민은 인간으로서의 존엄과 가치를 가지며, 행복을 추구할 권리를 가진다. 국가는 개인이 가지는 불가침의 기본적 인권을 확인하고 이를 보장할 의무를 진다.
                    국가안전보장회의는 대통령이 주재한다. 정당은 법률이 정하는 바에 의하여 국가의 보호를 받으며, 국가는 법률이 정하는 바에 의하여 정당운영에 필요한 자금을 보조할 수 있다.
                    형사피고인은 유죄의 판결이 확정될 때까지는 무죄로 추정된다. 국가는 국민 모두의 생산 및 생활의 기반이 되는 국토의 효율적이고 균형있는 이용·개발과 보전을 위하여 법률이 정하는 바에 의하여 그에 관한 필요한 제한과 의무를 과할 수 있다.
                </div>
            </div>
        </>
    )
}

export default Info;